Repository: ipmanuel/XMLDatabase
Catalog: Sources/XMLDatabase/*.lproj/Localizable.strings
Languages: de

source: The file "%@" does not exist at "%@".
de: Die Datei "%@" existiert nicht im Pfad "%@".

source: The file "%@" could not be renamed to "@" in "%@".
de: Die Datei "%@" konnte nicht zu "@" im Pfad "%@" umbenannt werden.

source: The filename of the given XML file "%@" located in "%@" is invalid.
de: Der Dateiname der angegebenen XML Datei "%@", welche sich im Pfad "%@" befindet, ist ungültig.

source: The given XML file "%@" located in "%@" does not exist.
de: Die angebene XML Datei "%@", welche sich im Pfad "%@" befinden soll, existiert nicht.

source: The given XML file "%@" located in "%@" is locked.
de: Die angegbene XML Dateo "%@", welche sich im Pfad "%@" befindet, ist gesperrt.

source: Could not read the file size of the XML file "%@" located in "%@" (error: "%@").
de: Die Dateigröße der XML Datei "%@", welche sich im Pfad "%@" befindet, konnte nicht ausgelesen werden (Fehler: "%@").

source: The required XML attribute "%@" is missing in the XML element "%@" in XML file "%@".
de: Das erforderliche XML Attribut "%@" für das XML Element "%@" wurde nicht in der XML Datei "%@" gefunden.

source: The required XML element "%@" is missing in XML file "%@".
de: Das erforderliche XML Element "%@" wurde nicht in der XML Datei "%@" gefunden.

source: The text "%@" of the XML element "%@" is invalid in XML file "%@".
de: Der Inhalt "%@" des XML Elements "%@" ist ungültig in der XML Datei "%@".

source: The XML root element "%@" is missing in in the XML file "%@".
de: Das XML Root Element "%@" wurde nicht in der XML Datei "%@" gefunden.

source: The id "%d" of the object exists already in XML file "%@".
de: Die Id "%d" des Objects exisitiert bereits in der XML Datei "%@".

source: The given number "%d" is not a valid id.
de: Die angebene Zahl "%d" ist keine gültige Id.

source: The given text "%@" contains not a valid id.
de: Der angebene Text "%@" enthält keine gültige Id.

# Hello my Name is Manuel!
source: Hello Englisch!
de: Hallo Deutsch!
